### This notebook illustrates some nuances of groupby and aggregation operations on pandas dataframes

* <em>When a numerical aggregation function (e.g. sum) is invoked, after a groupby operation, all of the nonnumerical columns are discarded in the grouped dataframe.</em>
     - Here's a slice of a transaction log for several companies that make  any or all among Hardware, software, and service products.

In [6]:
import pandas as pd
jan_transaction = pd.read_csv('sales-jan-2015.csv') 
jan_transaction.head()

                  Date    Company   Product  Units
0  2015-01-21 19:13:21  Streeplex  Hardware     11
1  2015-01-09 05:23:51  Streeplex   Service      8
2  2015-01-06 17:19:34    Initech  Hardware     17
3  2015-01-02 09:51:06      Hooli  Hardware     16
4  2015-01-11 14:51:02      Hooli  Hardware     11

Notice how (below) when we group by product and aggregate using the sum, only the summed units column is left among the nonkey columns. This is because we're invoking a function that only applies to nnumeric data, and 'Units' is the only numerical column.

In [8]:
jan_transaction.groupby('Company').sum()

                 Units
Company
Acme Coporation     76
Hooli               70
Initech             37
Mediacore           15
Streeplex           50